skybadger/ESP8266_AscomDome/ASCOM_DomeCmds.h
/*
File to be included into relevant device REST setup 
*/
//Assumes Use of ARDUINO ESP8266WebServer for entry handlers
#if !defined _ESP8266_DomeCmds_h_ 
#define _ESP8266_DomeCmds_h_
#include "AlpacaErrorConsts.h"
#include "ESP8266_AscomDome.h"
#include "JSONHelperFunctions.h"
#include <LinkedList.h>

 //prototypes
 float normaliseFloat( float& input, float radix);
 int normaliseInt( int& input, int radix ); 
 
 //interfaces to other inputs. 
 int restQuery( String uri, String args, String& response, int method );
 float getAzimuth( float );
 void setupEncoder();
 bool setupCompass( String host );
 float getBearing( String host );
 int getShutterStatus( String host , enum shutterState& );
  
 //Status Event processing
 cmdItem_t* addDomeCmd( uint32_t clientId, uint32_t transId, String cmdName, enum domeCmd, int value );
 cmdItem_t* addShutterCmd( uint32_t clientId, uint32_t transId, String cmdName, enum shutterCmd, int value );
 void updateCmdResponseList( int transID );
 void freeCmd( cmdItem_t* cmd );
 
 //dome state handlers
 void onDomeSlew();
 void onDomeAbort();
 void onDomeIdle();
 
 //Shutter state handlers
 void onShutterIdle();
 int shutterAltitude( int newAngle );
 int shutterSlew( enum shutterCmd setting );
 //int shutterAbort( void ); //deprecated

  float normaliseFloat( float& input, float radix) 
  {
    float temp = input;
    float output = 0.0F;
    output = fmod( input, radix ) ;
    while( output < 0.0F ) //some compilers allow negative values with mod
    {
      output += radix;
    }
    debugV( "NormaliseFloat: in: %f, out: %f", temp, output );
    input = output;
    return output;
  }
  
  int normaliseInt( int& input, int radix )
  {
    int temp = input;
    int output = 0;
    output = input % radix;
    while( output < 0 ) //some compilers allow negative values with mod
    {
      output += radix;
    }
    debugV( "NormaliseInt: in: %i, out: %i", temp, output );
    input = output;
    return output;  
  }

 /*
 * @brief create a new dome command list entry
 */
  cmdItem_t* addDomeCmd( uint32_t clientId, uint32_t transId, String cmdName, enum domeCmd newCmd, int value )
  {
      //Create new command
      cmdItem_t* pCmd = (cmdItem_t*) calloc( sizeof( cmdItem_t ), 1); 

      //Create copy buffer for the command name
      char* cptr = (char*) calloc( sizeof( char), cmdName.length() + 1 );
      strncpy( cptr, cmdName.c_str(), cmdName.length() );
      cptr[cmdName.length()] = '\0';

      //Add to list 
      pCmd->cmdName = cptr;
      pCmd->cmd = (int) newCmd;
      pCmd->value = value;
      pCmd->clientId = clientId;
      pCmd->transId = transId; 
      
      domeCmdList->add( pCmd );
      debugI( "Cmd pushed: %i", (int) newCmd ); 
      return pCmd;
  }

/*
 * @brief create a new shutter command list entry
 */ 
  cmdItem_t* addShutterCmd( uint32_t clientId, uint32_t transId, String cmdName, enum shutterCmd newCmd, int value )
  {
      //Create new command
      cmdItem_t* pCmd = (cmdItem_t*) calloc( sizeof( cmdItem_t ), 1); 

      //Create copy buffer for the command name
      char* cptr = (char*) calloc( sizeof( char ), cmdName.length() +1 );
      strncpy( cptr, cmdName.c_str(), cmdName.length() );
      cptr[cmdName.length()] = '\0';   
      
      //Add to list 
      pCmd->cmdName = cptr;
      pCmd->cmd = (int) newCmd;
      pCmd->value = value;
      pCmd->clientId = clientId;
      pCmd->transId = transId; 
      shutterCmdList->add( pCmd );

      debugI( "Cmd pushed: %i", (int) newCmd ); 
      return pCmd;
  }

  void freeCmd( cmdItem_t* ptr) 
  {
    //Safely release cmd memory
    //Clean up any memory dependencies
    if( ptr->cmdName != nullptr )
      free( ptr->cmdName );

    if( ptr != nullptr ) 
      free( (cmdItem_t*) ptr ); 
    
    debugV( "Cmd freed" ); 
    return;
  }
  
  /* Handle the command list - we've already checked we are idle at this point.
   */
  void onDomeIdle( void )
  {
    cmdItem_t* pCmd = nullptr;    
    enum domeCmd newCmd; 
    
    if ( domeCmdList->size() > 0 ) 
    {
      pCmd = domeCmdList->pop();
      debugI( "Popped new command: %i, value: %i", (int) pCmd->cmd, (int) pCmd->value );
      newCmd = (enum domeCmd ) pCmd->cmd;
      String cmd = "";
      switch ( newCmd )
      {
        // HOME and PARK are handled by slew commands but these entries satify the compiler warnings. 
        case CMD_DOME_HOME:
          targetAzimuth = (float) homePosition;
          domeStatus = DOME_SLEWING;
          onDomeSlew();
          break;

        case CMD_DOME_PARK:
          targetAzimuth = (float) homePosition;
          domeStatus = DOME_SLEWING;
          onDomeSlew();
          break;
          
        case CMD_DOME_SLEW:
          targetAzimuth = (float) pCmd->value;
          domeStatus = DOME_SLEWING;
          onDomeSlew();
          break;

        case CMD_DOME_ABORT:
          onDomeAbort();
          domeStatus = DOME_IDLE;
          targetAzimuth = currentAzimuth;
          break;
        
        case CMD_DOMEVAR_SET:
          //Did this so that dome variables aren't updated while waiting for commands that preceeded them to execute.   
          if ( pCmd->cmdName == nullptr )
          {
            debugW( "DOME_VAR_SET nullptr command name");
          }
          else 
          {
            cmd = String( pCmd->cmdName );
            debugD( "DOME_VAR_SET new command name: %s", pCmd->cmdName );            
          }
          
          if ( strlen( pCmd->cmdName) == 0 )
          {
            debugW( "DOME_VAR_SET empty command name");            
          }
          else if( cmd.equalsIgnoreCase( F("parkPosition")) )
          {
              parkPosition = (int) pCmd->value;
              debugI( "DOME_VAR_SET new park position : %i ", parkPosition );
              saveToEeprom();
          }
          else if ( cmd.equalsIgnoreCase( F("homePosition")) )
          {
              homePosition = (int) pCmd->value;
              debugI( "DOME_VAR_SET new home position : %i ", homePosition );
              saveToEeprom();
          }
          else if ( cmd.equalsIgnoreCase( F("azimuthSyncOffset") ) )
          {
              azimuthSyncOffset = (float) pCmd->value;
              debugI( "DOME_VAR_SET new sync offset : %f ", azimuthSyncOffset  );
              saveToEeprom();
              //01/06/2021 Updated to comply with requirement of updated Azimuth to be available after Sync. 
              //May not be fast enough. 
              currentAzimuth = bearing + azimuthSyncOffset;
          }
          domeStatus = DOME_IDLE;
          break;
        default:
          domeStatus = DOME_IDLE;
          break;
      }
    freeCmd( pCmd );
    }  
    return;
  }

