skybadger/ESP8266_AscomDome/ASCOM_DomeCmds.h
  /* 
   *  Not to query rotating shutter but to include offsets in returned result. 
   */  
  float getAzimuth( float value )
  {
    value = ( value + azimuthSyncOffset );
    normaliseFloat( value, 360.0F );
    return value;
  }
  
  /*
   * Handle dome rotation slew speeds and directions 
   * Slow to crawl once near target azimuth
   * Calc minimum distance to select direction
   */
  void onDomeSlew( void )
  {
    float distance = 0.0F;
    enum motorSpeed speed = MOTOR_SPEED_OFF;
    enum motorDirection direction = MOTOR_DIRN_CW; 
    float localAzimuth = 0.0F; 
      
    if( domeStatus != DOME_SLEWING )
    {
      slewing = false; //book-keeping
      return;
    }
      
    //getAzimuth keeps the value in range and applies any sync offset to the raw bearing. 
    localAzimuth = getAzimuth( bearing );
    //359-1 = 358
    //1-359 = -358
    
    //normalise keeps the distance in range 0-360
    distance = (targetAzimuth - localAzimuth);
    //distance = normaliseFloat( distance, 360.0 );
    debugD( "OnDomeSlew: current: %03.2f, target: %03.2f, distance %03.2f", localAzimuth, targetAzimuth, distance );

    //looking at the options for a-b < D where valid D might be small +ve, -ve or large +ve and large -ve    
    //Updated 29/09/21 to address slow speed when starting near 0 and inaccurate home/park determination
    float delta = 0.0F;

    //Work out direction and speed to turn dome
    delta = abs(distance);
    if( delta < acceptableAzimuthError || (360.0F - delta) < acceptableAzimuthError )
    {
      //Stop!!
      //turn off motor
      myMotor.setSpeedDirection( speed = MOTOR_SPEED_OFF, direction );

      //Update the desired state to say we have finished.
      domeStatus = DOME_IDLE;

      debugI( "Dome stopped at target: %03.1f", localAzimuth);
      if ( lcdPresent )
        myLCD.writeLCD( 2, 0, "Slew complete." );
      
      return; 
    }
    
    //01/06/2021 Amended to manage the zero hunting issue where the fast speed is selected for a small reversal slew. 
    //check to see whether we mean : 
    //from 4 to 356 = 352 or -8 after reversal or 
    //from 356 to 4 = -352 or +8 after reversal

    //we're not there yet so work out the direction. 
    debugD( "OnDomeSlew: raw distance : %f, direction : %i", distance, (int) direction  );    
    if( ( distance >= 0.0F ) && ( distance <= 180.0F ) ) 
    {
      direction = MOTOR_DIRN_CW;
    }
    else if( distance > 180.0F )
    {
      direction = MOTOR_DIRN_CCW;
      distance = 360 - distance;
    }
    else if ( ( distance > -180.0F ) && ( distance < 0.0F ) )
    {
      direction = MOTOR_DIRN_CCW;      
    }
    else //distance <= -180.0F
    {
      direction = MOTOR_DIRN_CW;
      distance = 360 + distance;
    }
    
    if ( abs(distance) < slowAzimuthRange )
    {
      speed = MOTOR_SPEED_SLOW_SLEW;
      debugD( "Dome speed reduced - distance: %f", (float) distance);
      if( lcdPresent )
        myLCD.writeLCD( 2, 0, "Slew::Slow" );      
    }
    else
    {
      speed = MOTOR_SPEED_FAST_SLEW;
      debugD( "Dome speed fast - distance: %f", distance );    
      if ( lcdPresent ) 
        myLCD.writeLCD( 2, 0, "Slew::Fast" );
    }
    debugD( "OnDomeSlew: raw distance : %f, direction : %i, speed: %i", distance, (int) direction, (int) speed  );      
    
    myMotor.setSpeedDirection( speed, direction );
    //myMotor.getSpeedDirection();
    //debugV("Motor returned - speed %u, direction: %u", ( uint) myMotor.getSpeed(), (uint) myMotor.getDirection() );
    return;
   }
  
 void updateCmdResponseList( int transID )
 {
    //TODO - Client presents transaction Id and we can check list for status enum and update list to show complete
    //Idea is that if we have a client come back to check, we answer. 
    //In practise client polls status so may drop this. 
    return;    
 }
  
  /*
   * Handler for domeAbort command
   * if an abort is called, this function clears down the async command stack
   * and puts the dome in a safe mode of not slewing and closed shutter. 
   * closed shutter seems fairly extreme though. 
   * @param void  
   * @return void 
   */ 
  void onDomeAbort( void )
  {
    //turn off motor
    if( motorPresent )
      myMotor.setSpeedDirection( MOTOR_SPEED_OFF, MOTOR_DIRN_CW );
    debugW("Aborting- motor set to stop");
    
    //message to LCD  
    if( lcdPresent ) 
      myLCD.writeLCD( 2, 0, "ABORT - dome halted." );
    
    // ? close shutter ?
    //TODO add call to halt shutter actions here. 
    
    //Update status to idle to process normally.
    domeStatus = DOME_IDLE;
    return;
  }

//Function to issue commands to shutter when idle. Otherwise wait until state is open or closed. 
void onShutterIdle()
{
  String response = "";
  String uri = "http://";
//enum shutterCmd              { CMD_SHUTTER_ABORT=0, CMD_SHUTTER_OPEN=4, CMD_SHUTTER_CLOSE=5, CMD_SHUTTERVAR_SET };
  enum shutterCmd newCmd = CMD_SHUTTER_ABORT;
  cmdItem_t* pCmd = nullptr;
  String cmd;
  
  switch ( shutterStatus )
  {
     case SHUTTER_ERROR:
     case SHUTTER_OPEN:
     case SHUTTER_CLOSED:
        //Get next command if there is one. 
        if ( shutterCmdList->size() > 0 ) 
        {
          pCmd = shutterCmdList->pop();
          newCmd = (enum shutterCmd) pCmd->cmd;
          debugI("OnShutterIdle - new command popped: %s", shutterCmdNames[(int)newCmd] );  

          switch( newCmd )
          {
            case CMD_SHUTTER_ABORT: 
            case CMD_SHUTTER_OPEN:  
            case CMD_SHUTTER_CLOSE:
                if( shutterSlew( newCmd ) != HTTP_CODE_OK )
                {
                  //put it back into head of list to retry next time around.
                  shutterCmdList->unshift( pCmd );
                }
                else //else consume and free 
                {
                  //Clean up 
                  updateCmdResponseList( pCmd->transId );            
                  freeCmd( pCmd ) ;
                  //clear down
                  if( newCmd == CMD_SHUTTER_ABORT )
                    shutterCmdList->clear();           //TODO this is a memory leak - fortunately rare and under our control
                }
                break;
            case CMD_SHUTTERVAR_SET:
                if( pCmd->cmdName != nullptr && strlen( pCmd->cmdName ) > 0 ) 
                {
                  cmd = String( pCmd->cmdName );
                  if( cmd.equalsIgnoreCase( F("altitude") ) && ( (int) pCmd->value >= SHUTTER_MIN_ALTITUDE ) && ( (int) pCmd->value <= SHUTTER_MAX_ALTITUDE ) )
                  { //If its at either end then that is open or closed, not an altitude
                     if( shutterAltitude( (int)pCmd->value ) != HTTP_CODE_OK )
                     {
                        //In range but call failed - try again by reloading for next time. 
                        shutterCmdList->unshift( pCmd );
                     }
                     else
                     {
                        updateCmdResponseList( pCmd->transId );                
                        freeCmd( pCmd ) ;
                     }                     
                  }
                  else
                  {
                    debugW( "Shutter cmd altitude out of range: %i ", (int) pCmd->value);                    
                    freeCmd( pCmd ) ; //Ignore and delete
                  }
                }
                break;
            default:
              break;
          }
          debugI("State outcome for shutter: %s ", shutterStateNames[ (int) shutterStatus ] );
       }  
       break;
     
