skybadger/ESP8266_AscomDome/ASCOM_DomeCmds.h
     //Wait for an idle state otherwise
     case SHUTTER_OPENING:
     case SHUTTER_CLOSING:
       debugI("Shutter opening or closing - waiting for idle to check for new state" );
       break;
     default: 
       debugW("Unknown state requested for shutter: %s ", shutterStateNames[(int) targetShutterStatus] );
       break;         
  }
}

/*
 * return HTTP_CODE_OK (200) for successful setting. 
 */
int shutterSlew( enum shutterCmd setting )
{
    String outbuf = "";
    String uri = "http://";
    String arg = "shutter=";
    int errorCode = 200;
    
    uri.concat( shutterHostname );
    uri.concat("/shutter");

    debugD( "shutterSlew: setting: %s", shutterCmdNames[(int) setting] );
    switch( setting )
    {
      case CMD_SHUTTER_ABORT: arg.concat( F("abort") );
        break;
      case CMD_SHUTTER_OPEN:  arg.concat( F("open") );
        break;
      case CMD_SHUTTER_CLOSE: arg.concat( F("close") );
        break;
      default: 
        debugE( "invalid shutterState provided to shutterSlew: %i - ignoring", (int) setting );
      break;
    }   

    errorCode = restQuery( uri, arg, outbuf, HTTP_PUT );  
    if( errorCode == HTTP_CODE_OK )
    {
      debugV("Successfully issued new state '%s' to shutter", arg.c_str() );
      if ( setting == CMD_SHUTTER_OPEN )
        shutterStatus = SHUTTER_OPENING;
      else if ( setting == CMD_SHUTTER_CLOSE )
        shutterStatus = SHUTTER_CLOSING;
      else if( setting == CMD_SHUTTER_ABORT )
      {
         if( shutterStatus == SHUTTER_OPENING || shutterStatus == SHUTTER_OPEN || shutterStatus == SHUTTER_CLOSING )
           shutterStatus = SHUTTER_OPEN;
         else 
           shutterStatus = SHUTTER_CLOSED;
      }
    }
    else 
    {
      debugW("Failed to send new state Cmd to shutter, error %d", (int) errorCode );
    }
    return errorCode;
}

/*
 * Return HTTP_CODE_OK (200) for success or other HTTP query response code for failure 
 */
int shutterAltitude( int newAngle )
{
    String outbuf = "";
    String uri = "http:";
    String arg = "altitude=";
    
    uri.concat( shutterHostname );
    uri.concat("/shutter");
    arg.concat( newAngle );
        
    debugD(" Setting up to send new altitude to shutter");
    int response = restQuery( uri, arg, outbuf, HTTP_PUT);
    if( response == HTTP_CODE_OK )
    {
      debugD("Issued new altitude %i to shutter, currently at %i", newAngle, altitude );
      if( newAngle > altitude && newAngle <= SHUTTER_MAX_ALTITUDE )     
        shutterStatus = SHUTTER_OPENING;
      else if ( newAngle < altitude && ( newAngle >= SHUTTER_MIN_ALTITUDE ) ) 
        shutterStatus = SHUTTER_CLOSING;
      else if ( newAngle == altitude && ( newAngle > SHUTTER_MIN_ALTITUDE ) && ( newAngle <= SHUTTER_MAX_ALTITUDE ) )
        shutterStatus = SHUTTER_OPEN;
      else 
        shutterStatus = SHUTTER_CLOSED;
    }
    else 
    {
      //what to do ?
      debugW("Failed to send new altitude to shutter, return HTTP code %i", response );
      //Preserve existing state - no change
    }
    return response;
}
  
  /*
   * Stop shutter moving. 
   * Return HTTP_CODE_OK for good reponse and HTTP query codes for anything else. 
   * Now handled in shutterSlew above. 

  int shutterAbort( void )
  {
    int response = 200;
    String outbuf = "";
    String uri = "http:";
    //shutterCmdList->clear();
    uri.concat( sensorHostname );
    uri.concat("/shutter");

    debugV("Abort issued to shutter.");
    response = restQuery( uri, "{\"status\":\"abort\"}", outbuf ,HTTP_PUT);
    if( response == HTTP_CODE_OK)
    {
      debugV("Abort successful.");
      if( shutterStatus == SHUTTER_OPENING || shutterStatus == SHUTTER_CLOSING || shutterStatus == SHUTTER_OPEN )
        shutterStatus = SHUTTER_OPEN;
      else
      {
        shutterStatus = SHUTTER_CLOSED;
      }
    }
    else 
    {
      //retain existing state
      debugW("Failed to issue Abort to shutter, return HTTP response %i", response );
    }
    return response;
  } 
*/  
  void setupEncoder()
  {
    //TODO if we ever have a locally-attached encoder. 
    return;
  }
 
  //Detect compass service and initialise azimuth bearing of dome
  bool setupCompass( String targetHost )
  {
    bool status = false;
    String compassURL = "http://";
    String output = "";
    int response = 0;
    float value;
    DynamicJsonBuffer jsonBuff(256);
    
    compassURL.concat( sensorHostname );
    compassURL.concat( "/bearing" );
    response = restQuery( compassURL, "", output, HTTP_GET );
#if defined DEBUG_ESP_HTTP_CLIENT      
    debugD( "[HTTPClient response ] response code: %i, response: %s", (int) response, output.c_str() );
#endif    
    JsonObject& root = jsonBuff.parse( output );
    
    if ( response == HTTP_CODE_OK && root.success() && root.containsKey(F("bearing")) )
    {
      value = (float) root.get<float>("bearing"); //initialise current setting
      status = true;
    }
    else
    {
      debugE( "Shutter compass bearing call not successful, response: %i", (int) response );
#if defined DEBUG_ESP_HTTP_CLIENT      
      debugV( "bearing json content: %s", output.c_str() );
#endif      
      debugW( "JSON parsing status: %i", (int) root.success() );
    }
    return status;
  }

  /*
   * Query a url for a parsed json output
   * check return code with object.success();
   */ 
  int restQuery( String host, String args, String& response, int method )
  {
    int httpCode = 0;
    long int startTime;
    long int endTime;
    //HTTPClient hClient; //uses a global 
    hClient.setTimeout ( (uint16_t) 250 );    
    hClient.setReuse( HTTP_CLIENT_REUSE );    
    
    debugD("restQuery request - uri:%s, args:%s, method: %i", host.c_str(), args.c_str(), (int) method );
    startTime = millis();
    //host and args are separate, need to join them for a GET parameterised request.    
    //if ( hClient.begin( wClient, uri ) ) uri must already have request args in it
    if ( hClient.begin( wClient, host) ) 
    {
      if( method == HTTP_GET )
      {
        httpCode = hClient.GET();
      }
      else if ( method == HTTP_PUT ) //variables are added as headers
      {
        //hClient.addHeader("Content-Type", "application/json"); 
        hClient.addHeader(F("Content-Type"), F("application/x-www-form-urlencoded") );
        httpCode = hClient.PUT( args.c_str() );        
      }

