skybadger/ESP8266_AscomDome/ASCOM_DomeCmds.h
      endTime = millis();
#if defined DEBUG_ESP_HTTP_CLIENT            
        debugV( "Time for restQuery call(mS): %li\n", (long int) endTime-startTime );
#endif        

      // file found at server ?
      if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) 
      {
        response = hClient.getString();
#if defined DEBUG_ESP_HTTP_CLIENT      
        debugV("HTTP rest query response : %s\n", response.c_str() );
#endif        
      }
      else 
      {
#if defined DEBUG_ESP_HTTP_CLIENT      
        debugV("restQuery ... failed, error: %s\n", hClient.errorToString(httpCode).c_str() );
#endif        
        ;;
      } 
    }
    else
    {
       debugE("restQuery Unable to open connection");
    }  
    hClient.end();
    return httpCode;
  }
  
#if defined USE_REMOTE_COMPASS_FOR_DOME_ROTATION || defined USE_REMOTE_ENCODER_FOR_DOME_ROTATION
  /*
   * Function to determine bearing of dome - just return a sane value to the caller. Let the caller handler sync offsets. 
   * Note that if we do this right we can point this at any device that returns a 'bearing' in the rest response as long as the url is
   * setup correctly in the setup pages. 
   * That means the 'host' string is no longer strictly just a hostname. 
   */
  float getBearing( String host)
  {
    long int duration = millis();
    static int bearingRepeatCount = 0;
    const int bearingRepeatLimit = 10;
    static float lastBearing = bearing;
    float localBearing = 0.0F;
    int response = 0;
    String outbuf = "";
    String path = "";
    DynamicJsonBuffer jsonBuff(250);    
    
    //Update the bearing
    path = String( F("http://") );
    path += host;
    path += F("/bearing");
#if defined DEBUG_ESP_HTTP_CLIENT      
    debugV("GetBearing using remote device - host path: %s \n", path.c_str() );
    debugV("GetBearing setup - host uri: %s \n", host.c_str() );
#endif    
    response = restQuery( path, "", outbuf, HTTP_GET );
#if defined DEBUG_ESP_HTTP_CLIENT      
    debugD("GetBearing response - code: %i, output: %s", response, outbuf.c_str() );
#endif
    
    //Sometimes we get a good HTTP code but still no body... 
    JsonObject& root = jsonBuff.parse( outbuf );
    if ( response == HTTP_CODE_OK ) 
    {            
      if( root.success() && root.containsKey( "bearing" ) )
      {
        localBearing = (float) root["bearing"];
        lastBearing = localBearing;

        debugD(" GetBearing: localBearing %f", localBearing );     

#if defined USE_REMOTE_COMPASS_FOR_DOME_ROTATION        
        //this isnt the right thing to do if its due to not getting a rest response in time from a busy device. 
        if ( lastBearing == bearing ) //We do this to check for sensor freeze
        {
          bearingRepeatCount ++;
          debugW(" GetBearing: Sensor stuck %i detected @ %f\n", bearingRepeatCount, bearing );
          
          //reset the compass by resetting the target device
          if ( bearingRepeatCount > bearingRepeatLimit ) 
          {  
            uri = "http://";
            uri.concat( host );
            uri.concat( "/reset" );
            
            response = restQuery( uri, "", outbuf, HTTP_PUT );
            debugW(" GetBearing: Compass reset attempted !");
            if (myLCD.present ) 
              myLCD.writeLCD( 2, 0, "Compass reset !");
            bearingRepeatCount = 0;
          }
        }
        else
        {
          bearingRepeatCount = 0;            
        }
#endif      
      }
      else //can't retrieve the bearing
      {
      debugV( "Response code: %i, parse success: %i, json data: %s", response, (int) root.success(), outbuf.c_str() );
      debugW( "No reading, using last  ");
      localBearing = lastBearing;
      }
    }//HTTP_CODE_OK
    duration = millis()-duration;
    debugI( "request duration %li", (long int) duration);
    return localBearing;
  }
#else //if local interface in use
   //write something for the local case of local hardware encoder interface
 float getBearing( )
 {
   int localPosition = 0;
   localPosition = myEnc.read();
   if( localPosition != lastPosition )
   {
      if( localPosition < 0 )
      {
        localPosition = encoderTicksPerRevolution + localPosition;
        myEnc.write( localPosition );
        position = localPosition;
      }
      else if ( localPosition > encoderTicksPerRevolution )
      {
         localPosition = localPosition - encoderTicksPerRevolution;
        myEnc.write( localPosition );
        position = localPosition;
      }
   lastPosition = position;
   }
   return position/encoderTicksPerRevolution * 360.0F;
 } 
#endif //Not remote

  /*
   * Rest call to retrieve shutter Status. 
     updated to address request failure by not going straight to ERROR. 
   */ 
  int getShutterStatus( String host, enum shutterState& outputState )
  {
    String outbuf;
    long int duration = millis();
    enum shutterState value = SHUTTER_ERROR;
    DynamicJsonBuffer jsonBuff(250);

    String uri = String( F("http://") );
    uri.concat( host );
    uri.concat( F("/shutter") );
    int response = restQuery( uri , "", outbuf, HTTP_GET  );
    
    if( response == HTTP_CODE_OK ) 
    {
      JsonObject& root = jsonBuff.parse( outbuf ); 
      if ( root.success() && root.containsKey("status") )
      {
        value = ( enum shutterState) root.get<int>("status");
      }
      else
      {
        value = shutterStatus; //Report the last response in the meantime. 
        debugW("Shutter controller call not successful, buffer: %s", outbuf.c_str() );
        debugV("Shutter response: %i, parse result %i, json data %s", (int) response, (int) root.success(), outbuf.c_str() );
  
  #if defined DEBUG_ESP_HTTP_CLIENT      
        Serial.printf( "Shutter response: %i, parse result %i, json data %s\n", response, (int) root.success(), outbuf.c_str() );
  #endif      
      }
    }

    duration = millis() - duration;
    debugI( " duration: %li", (long int) duration );
    outputState = value;
    return response;
  }

#endif
